# Insulation Material Class

Source: https://www.revitapidocs.com/2026/bbf4850c-aa6f-53ef-408e-97f25d869ee5.htm

---

| Insulation Material Class |
| --- |

This class represents the definition of Conductor Insulation Material data. Inheritance Hierarchy System Object
Autodesk.Revit.DB.Electrical InsulationMaterial

**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class InsulationMaterial : IDisposable
```

```
Public Class InsulationMaterial
	Implements IDisposable
```

```
public ref class InsulationMaterial : IDisposable
```

```
type InsulationMaterial =
    class
        interface IDisposable
    end
```
The InsulationMaterial type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | Id | The Conductor Insulation Material id. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The Conductor Insulation Material name. |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a Conductor Insulation Material. |
|  | Dispose | Releases all resources used by the InsulationMaterial |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetInsulationMaterial | Gets the Conductor Insulation Material data by given Conductor Insulation Material id. |
|  | GetInsulationMaterialIdByName | Gets the Conductor Insulation Material id by given Conductor Insulation Material name. |
|  | GetInsulationMaterialIds | Gets all the Conductor Insulation Material ids in the given document, sorted by name. |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

Autodesk.Revit.DB.Electrical Namespace